nxp-mcuxpresso/mcux-devices-rt/RT1040/MIMXRT1046/drivers/fsl_clock.h
    kCLOCK_IpgDivBy1 = 0, /*!< IPG clock divider set to divided by 1. */
    kCLOCK_IpgDivBy2 = 1, /*!< IPG clock divider set to divided by 2. */
    kCLOCK_IpgDivBy3 = 2, /*!< IPG clock divider set to divided by 3. */
    kCLOCK_IpgDivBy4 = 3, /*!< IPG clock divider set to divided by 4. */

    kCLOCK_Flexspi2DivBy1 = 0, /*!< Flexspi2 divider set to divided by 1. */
    kCLOCK_Flexspi2DivBy2 = 1, /*!< Flexspi2 divider set to divided by 2. */
    kCLOCK_Flexspi2DivBy3 = 2, /*!< Flexspi2 divider set to divided by 3. */
    kCLOCK_Flexspi2DivBy4 = 3, /*!< Flexspi2 divider set to divided by 4. */
    kCLOCK_Flexspi2DivBy5 = 4, /*!< Flexspi2 divider set to divided by 5. */
    kCLOCK_Flexspi2DivBy6 = 5, /*!< Flexspi2 divider set to divided by 6. */
    kCLOCK_Flexspi2DivBy7 = 6, /*!< Flexspi2 divider set to divided by 7. */
    kCLOCK_Flexspi2DivBy8 = 7, /*!< Flexspi2 divider set to divided by 8. */

    kCLOCK_LpspiDivBy1 = 0, /*!< Lpspi divider set to divided by 1. */
    kCLOCK_LpspiDivBy2 = 1, /*!< Lpspi divider set to divided by 2. */
    kCLOCK_LpspiDivBy3 = 2, /*!< Lpspi divider set to divided by 3. */
    kCLOCK_LpspiDivBy4 = 3, /*!< Lpspi divider set to divided by 4. */
    kCLOCK_LpspiDivBy5 = 4, /*!< Lpspi divider set to divided by 5. */
    kCLOCK_LpspiDivBy6 = 5, /*!< Lpspi divider set to divided by 6. */
    kCLOCK_LpspiDivBy7 = 6, /*!< Lpspi divider set to divided by 7. */
    kCLOCK_LpspiDivBy8 = 7, /*!< Lpspi divider set to divided by 8. */

    kCLOCK_LcdifDivBy1 = 0, /*!< Lcdif divider set to divided by 1. */
    kCLOCK_LcdifDivBy2 = 1, /*!< Lcdif divider set to divided by 2. */
    kCLOCK_LcdifDivBy3 = 2, /*!< Lcdif divider set to divided by 3. */
    kCLOCK_LcdifDivBy4 = 3, /*!< Lcdif divider set to divided by 4. */
    kCLOCK_LcdifDivBy5 = 4, /*!< Lcdif divider set to divided by 5. */
    kCLOCK_LcdifDivBy6 = 5, /*!< Lcdif divider set to divided by 6. */
    kCLOCK_LcdifDivBy7 = 6, /*!< Lcdif divider set to divided by 7. */
    kCLOCK_LcdifDivBy8 = 7, /*!< Lcdif divider set to divided by 8. */

    kCLOCK_FlexspiDivBy1 = 0, /*!< Flexspi divider set to divided by 1. */
    kCLOCK_FlexspiDivBy2 = 1, /*!< Flexspi divider set to divided by 2. */
    kCLOCK_FlexspiDivBy3 = 2, /*!< Flexspi divider set to divided by 3. */
    kCLOCK_FlexspiDivBy4 = 3, /*!< Flexspi divider set to divided by 4. */
    kCLOCK_FlexspiDivBy5 = 4, /*!< Flexspi divider set to divided by 5. */
    kCLOCK_FlexspiDivBy6 = 5, /*!< Flexspi divider set to divided by 6. */
    kCLOCK_FlexspiDivBy7 = 6, /*!< Flexspi divider set to divided by 7. */
    kCLOCK_FlexspiDivBy8 = 7, /*!< Flexspi divider set to divided by 8. */

    kCLOCK_TraceDivBy1 = 0, /*!< Trace divider set to divided by 1. */
    kCLOCK_TraceDivBy2 = 1, /*!< Trace divider set to divided by 2. */
    kCLOCK_TraceDivBy3 = 2, /*!< Trace divider set to divided by 3. */
    kCLOCK_TraceDivBy4 = 3, /*!< Trace divider set to divided by 4. */

    kCLOCK_Usdhc2DivBy1 = 0, /*!< Usdhc2 divider set to divided by 1. */
    kCLOCK_Usdhc2DivBy2 = 1, /*!< Usdhc2 divider set to divided by 2. */
    kCLOCK_Usdhc2DivBy3 = 2, /*!< Usdhc2 divider set to divided by 3. */
    kCLOCK_Usdhc2DivBy4 = 3, /*!< Usdhc2 divider set to divided by 4. */
    kCLOCK_Usdhc2DivBy5 = 4, /*!< Usdhc2 divider set to divided by 5. */
    kCLOCK_Usdhc2DivBy6 = 5, /*!< Usdhc2 divider set to divided by 6. */
    kCLOCK_Usdhc2DivBy7 = 6, /*!< Usdhc2 divider set to divided by 7. */
    kCLOCK_Usdhc2DivBy8 = 7, /*!< Usdhc2 divider set to divided by 8. */

    kCLOCK_Usdhc1DivBy1 = 0, /*!< Usdhc1 divider set to divided by 1. */
    kCLOCK_Usdhc1DivBy2 = 1, /*!< Usdhc1 divider set to divided by 2. */
    kCLOCK_Usdhc1DivBy3 = 2, /*!< Usdhc1 divider set to divided by 3. */
    kCLOCK_Usdhc1DivBy4 = 3, /*!< Usdhc1 divider set to divided by 4. */
    kCLOCK_Usdhc1DivBy5 = 4, /*!< Usdhc1 divider set to divided by 5. */
    kCLOCK_Usdhc1DivBy6 = 5, /*!< Usdhc1 divider set to divided by 6. */
    kCLOCK_Usdhc1DivBy7 = 6, /*!< Usdhc1 divider set to divided by 7. */
    kCLOCK_Usdhc1DivBy8 = 7, /*!< Usdhc1 divider set to divided by 8. */

    kCLOCK_Flexio2DivBy1 = 0, /*!< Flexio2 divider set to divided by 1. */
    kCLOCK_Flexio2DivBy2 = 1, /*!< Flexio2 divider set to divided by 2. */
    kCLOCK_Flexio2DivBy3 = 2, /*!< Flexio2 divider set to divided by 3. */
    kCLOCK_Flexio2DivBy4 = 3, /*!< Flexio2 divider set to divided by 4. */
    kCLOCK_Flexio2DivBy5 = 4, /*!< Flexio2 divider set to divided by 5. */
    kCLOCK_Flexio2DivBy6 = 5, /*!< Flexio2 divider set to divided by 6. */
    kCLOCK_Flexio2DivBy7 = 6, /*!< Flexio2 divider set to divided by 7. */
    kCLOCK_Flexio2DivBy8 = 7, /*!< Flexio2 divider set to divided by 8. */

    kCLOCK_Sai3PreDivBy1 = 0, /*!< Sai3Pre divider set to divided by 1. */
    kCLOCK_Sai3PreDivBy2 = 1, /*!< Sai3Pre divider set to divided by 2. */
    kCLOCK_Sai3PreDivBy3 = 2, /*!< Sai3Pre divider set to divided by 3. */
    kCLOCK_Sai3PreDivBy4 = 3, /*!< Sai3Pre divider set to divided by 4. */
    kCLOCK_Sai3PreDivBy5 = 4, /*!< Sai3Pre divider set to divided by 5. */
    kCLOCK_Sai3PreDivBy6 = 5, /*!< Sai3Pre divider set to divided by 6. */
    kCLOCK_Sai3PreDivBy7 = 6, /*!< Sai3Pre divider set to divided by 7. */
    kCLOCK_Sai3PreDivBy8 = 7, /*!< Sai3Pre divider set to divided by 8. */

    kCLOCK_Flexio2PreDivBy1 = 0, /*!< Flexio2Pre divider set to divided by 1. */
    kCLOCK_Flexio2PreDivBy2 = 1, /*!< Flexio2Pre divider set to divided by 2. */
    kCLOCK_Flexio2PreDivBy3 = 2, /*!< Flexio2Pre divider set to divided by 3. */
    kCLOCK_Flexio2PreDivBy4 = 3, /*!< Flexio2Pre divider set to divided by 4. */
    kCLOCK_Flexio2PreDivBy5 = 4, /*!< Flexio2Pre divider set to divided by 5. */
    kCLOCK_Flexio2PreDivBy6 = 5, /*!< Flexio2Pre divider set to divided by 6. */
    kCLOCK_Flexio2PreDivBy7 = 6, /*!< Flexio2Pre divider set to divided by 7. */
    kCLOCK_Flexio2PreDivBy8 = 7, /*!< Flexio2Pre divider set to divided by 8. */

    kCLOCK_Sai1PreDivBy1 = 0, /*!< Sai1Pre divider set to divided by 1. */
    kCLOCK_Sai1PreDivBy2 = 1, /*!< Sai1Pre divider set to divided by 2. */
    kCLOCK_Sai1PreDivBy3 = 2, /*!< Sai1Pre divider set to divided by 3. */
    kCLOCK_Sai1PreDivBy4 = 3, /*!< Sai1Pre divider set to divided by 4. */
    kCLOCK_Sai1PreDivBy5 = 4, /*!< Sai1Pre divider set to divided by 5. */
    kCLOCK_Sai1PreDivBy6 = 5, /*!< Sai1Pre divider set to divided by 6. */
    kCLOCK_Sai1PreDivBy7 = 6, /*!< Sai1Pre divider set to divided by 7. */
    kCLOCK_Sai1PreDivBy8 = 7, /*!< Sai1Pre divider set to divided by 8. */

    kCLOCK_Sai2PreDivBy1 = 0, /*!< Sai2Pre divider set to divided by 1. */
    kCLOCK_Sai2PreDivBy2 = 1, /*!< Sai2Pre divider set to divided by 2. */
    kCLOCK_Sai2PreDivBy3 = 2, /*!< Sai2Pre divider set to divided by 3. */
    kCLOCK_Sai2PreDivBy4 = 3, /*!< Sai2Pre divider set to divided by 4. */
    kCLOCK_Sai2PreDivBy5 = 4, /*!< Sai2Pre divider set to divided by 5. */
    kCLOCK_Sai2PreDivBy6 = 5, /*!< Sai2Pre divider set to divided by 6. */
    kCLOCK_Sai2PreDivBy7 = 6, /*!< Sai2Pre divider set to divided by 7. */
    kCLOCK_Sai2PreDivBy8 = 7, /*!< Sai2Pre divider set to divided by 8. */

